# Occupation

### Introduction:

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users.

In [7]:
users =pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep="|",index_col="user_id")
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

### Step 4. Discover what is the mean age per occupation

In [10]:
users.groupby('occupation').mean().head()

                     age
occupation
administrator  38.746835
artist         31.392857
doctor         43.571429
educator       42.010526
engineer       36.388060

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [88]:
a=pd.DataFrame(users.groupby('occupation').gender.value_counts('M').sort_values(ascending=False))
b=pd.DataFrame(a.rename(columns={'gender':'ratio'}).reset_index())
b[b.gender=="M"].head()

   occupation gender     ratio
0      doctor      M  1.000000
1    engineer      M  0.970149
2  technician      M  0.962963
3     retired      M  0.928571
4  programmer      M  0.909091

### Step 6. For each occupation, calculate the minimum and maximum ages

In [75]:
users.groupby('occupation').age.agg(['min','max']).head()

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70

### Step 7. For each combination of occupation and gender, calculate the mean age

In [77]:
users.groupby(['occupation','gender']).mean().head()

                            age
occupation    gender
administrator F       40.638889
              M       37.162791
artist        F       30.307692
              M       32.333333
doctor        M       43.571429

### Step 8.  For each occupation present the percentage of women and men

In [89]:
b['ratio']=b['ratio']*100
b.head()

   occupation gender       ratio
0      doctor      M  100.000000
1    engineer      M   97.014925
2  technician      M   96.296296
3     retired      M   92.857143
4  programmer      M   90.909091